Overlapping independent type associated gridlines are not allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotHaveIndependentOverlappingGrids { get; }
  Visual Basic
Public Shared ReadOnly Property CannotHaveIndependentOverlappingGrids As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotHaveIndependentOverlappingGrids {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace